In [1]:
from env import user, password, host
import os
import pandas as pd
from wrangle import wrangle_telco
import split_scale

In [13]:
df = wrangle_telco()

In [14]:
df.head()

  customer_id  monthly_charges  tenure  total_charges
0  0013-SMEOE           109.70      71        7904.25
1  0014-BMAQU            84.65      63        5377.80
2  0016-QLJIS            90.45      65        5957.90
3  0017-DINOC            45.20      54        2460.55
4  0017-IUDMW           116.80      72        8456.75

In [15]:
train, validate, test = split_scale.split_my_data(df)

In [16]:
train.head()

     customer_id  monthly_charges  tenure  total_charges
81    0485-ZBSLN            24.75      65        1715.10
417   2521-NPUZR           101.00      70        7085.50
754   4674-HGNUA            89.90      71        6457.15
1605  9489-DEDVP            69.20      70        4872.35
325   2017-CCBLH            20.00       8         141.60

In [17]:
scaler, train_scaled, validate_scaled, test_scaled = split_scale.iqr_robust_scaler(train, validate, test)

In [18]:
scaler

RobustScaler(copy=True, quantile_range=(25.0, 75.0), with_centering=True,
             with_scaling=True)

In [19]:
train_scaled

      monthly_charges    tenure  total_charges
81          -0.571636  0.041667      -0.383487
417          0.537455  0.250000       0.776931
754          0.376000  0.291667       0.641159
1605         0.074909  0.250000       0.298721
325         -0.640727 -2.333333      -0.723484
...               ...       ...            ...
1615        -0.644364 -1.666667      -0.649683
1361        -0.412364  0.125000      -0.204014
1607         0.010182  0.333333       0.284114
1133         0.236364 -0.041667       0.325298
766         -0.638545 -1.000000      -0.580171

[1220 rows x 3 columns]

In [20]:
train

     customer_id  monthly_charges  tenure  total_charges
81    0485-ZBSLN            24.75      65        1715.10
417   2521-NPUZR           101.00      70        7085.50
754   4674-HGNUA            89.90      71        6457.15
1605  9489-DEDVP            69.20      70        4872.35
325   2017-CCBLH            20.00       8         141.60
...          ...              ...     ...            ...
1615  9548-LERKT            19.75      24         483.15
1361  8069-RHUXK            35.70      67        2545.70
1607  9499-XPZXM            64.75      72        4804.75
1133  6741-QRLUP            80.30      63        4995.35
766   4735-BJKOU            20.15      40         804.85

[1220 rows x 4 columns]

In [21]:
train_unscaled, validate_unscaled, test_unscaled = split_scale.scale_inverse(scaler, train_scaled, validate_scaled, test_scaled)

In [22]:
train_unscaled

      monthly_charges  tenure  total_charges
81              24.75    65.0        1715.10
417            101.00    70.0        7085.50
754             89.90    71.0        6457.15
1605            69.20    70.0        4872.35
325             20.00     8.0         141.60
...               ...     ...            ...
1615            19.75    24.0         483.15
1361            35.70    67.0        2545.70
1607            64.75    72.0        4804.75
1133            80.30    63.0        4995.35
766             20.15    40.0         804.85

[1220 rows x 3 columns]

In [23]:
train

     customer_id  monthly_charges  tenure  total_charges
81    0485-ZBSLN            24.75      65        1715.10
417   2521-NPUZR           101.00      70        7085.50
754   4674-HGNUA            89.90      71        6457.15
1605  9489-DEDVP            69.20      70        4872.35
325   2017-CCBLH            20.00       8         141.60
...          ...              ...     ...            ...
1615  9548-LERKT            19.75      24         483.15
1361  8069-RHUXK            35.70      67        2545.70
1607  9499-XPZXM            64.75      72        4804.75
1133  6741-QRLUP            80.30      63        4995.35
766   4735-BJKOU            20.15      40         804.85

[1220 rows x 4 columns]